
#######################################################################################
## 2022-05-17-(화)
## level01 - 없는 숫자 더하기
#######################################################################################
## TO DO
## 0부터 9까지의 숫자 중 일부가 들어있는 정수 배열 numbers가 매개변수로 주어집니다. 
## numbers에서 찾을 수 없는 0부터 9까지의 숫자를 모두 찾아 더한 수를 return 하도록 solution 함수를 완성해주세요.
#######################################################################################

def solution(numbers):
    answer = 0
    pair = [0,1,2,3,4,5,6,7,8,9]
    sum = []
    sorted(numbers)
    # print(numbers) # [1, 2, 3, 4, 6, 7, 8, 0]
    for n in pair:
        if n not in numbers:
            sum.append(n)

    for s in sum:
        answer += s

    return answer

if __name__ == '__main__':
    # numbers = [1,2,3,4,6,7,8,0] # 14
    numbers = [5,8,4,0,6,7,9] # 6
    print(solution(numbers))


####################################
## 다른 풀이 
####################################

def solution(numbers):
    return 45 - sum(numbers)
