
#######################################################################################
## fileName: 220517_내적(pass)
## level01 
#######################################################################################
## TO DO
# 길이가 같은 두 1차원 정수 배열 a, b가 매개변수로 주어집니다. a와 b의 내적을 return 하도록 solution 함수를 완성해주세요.
# 이때, a와 b의 내적은 a[0]*b[0] + a[1]*b[1] + ... + a[n-1]*b[n-1] 입니다. (n은 a, b의 길이)
#######################################################################################

def solution(a, b):
    answer = 0
    
    for n in range(len(a)):
        answer += a[n]*b[n]
    
    return answer 



if __name__ == '__main__':
    # a = [1,2,3,4] 
    # b = [-3,-1,0,2]
    ## 3

    a = [-1,0,1]
    b = [1,0,-1]
    ## -2
    print(solution(a, b))

#############################
## 다른 풀이 
#############################

def solution(a, b):

    return sum([x*y for x, y in zip(a,b)])

#############################
## 따라 쓰기
#############################

def solution(a,b):
    
    return sum([x*y for x,y in zip(a,b)])
